jiushiggg/MR33/rf/cc2640r2_rf.c
#include "cc2640r2_rf.h"
#include <ti/sysbios/BIOS.h>
#include <ti/sysbios/knl/Clock.h>
#include <xdc/runtime/Error.h>
#include <ti/drivers/pin/PINCC26XX.h>
#include "CC2592.h"
#include "event.h"

#define RF_TEST
#define RF_TX_TEST_IO       IOID_28
#define RF_RX_TEST_IO       IOID_29
#define RF_RX_DATA_TEST_IO  IOID_16
#define RF_RX_SYNC_TEST_IO  IOID_17


#define RF_SEND_TIME        900     //900us
/***** Defines *****/
#define myRF_convertUsToRatTicks(Us)    ((uint32_t)(Us) * 4 * 10)
/* Packet TX/RX Configuration */
#define PAYLOAD_LENGTH      26
#define DATA_ENTRY_HEADER_SIZE 8  /* Constant header size of a Generic Data Entry */
#define MAX_LENGTH             26 /* Max length byte the radio will accept */
#define MAX_LENGTH_128            128 /* Max length byte the radio will accept */
#define NUM_DATA_ENTRIES       1  /* NOTE: Only two data entries supported at the moment */
#define NUM_APPENDED_BYTES     2  /* The Data Entries data field will contain:
                                   * 1 Header byte (RF_cmdPropRx.rxConf.bIncludeHdr = 0x1)
                                   * Max 30 payload bytes
                                   * 1 status byte (RF_cmdPropRx.rxConf.bAppendStatus = 0x1) */
#define HB_NUM_DATA_ENTRIES	   2/* NOTE: Only two data entries supported at the moment */

#define EASYLINK_RF_EVENT_MASK  ( RF_EventLastCmdDone | RF_EventCmdError | \
             RF_EventCmdAborted | RF_EventCmdStopped | RF_EventCmdCancelled )


#if defined(__TI_COMPILER_VERSION__)
    #pragma DATA_ALIGN (rxDataEntryBuffer, 4);
        static uint8_t rxDataEntryBuffer[RF_QUEUE_DATA_ENTRY_BUFFER_SIZE(NUM_DATA_ENTRIES,
                                                                         MAX_LENGTH_128,
                                                                 NUM_APPENDED_BYTES)];
        static uint8_t rxHBDataEntryBuffer[RF_QUEUE_DATA_ENTRY_BUFFER_SIZE(HB_NUM_DATA_ENTRIES,
                                                                 MAX_LENGTH,
                                                                 NUM_APPENDED_BYTES)];
#elif defined(__IAR_SYSTEMS_ICC__)
    #pragma data_alignment = 4
        static uint8_t rxDataEntryBuffer[RF_QUEUE_DATA_ENTRY_BUFFER_SIZE(NUM_DATA_ENTRIES,
                                                                 MAX_LENGTH,
                                                                 NUM_APPENDED_BYTES)];
#elif defined(__GNUC__)
        static uint8_t rxDataEntryBuffer [RF_QUEUE_DATA_ENTRY_BUFFER_SIZE(NUM_DATA_ENTRIES,
            MAX_LENGTH, NUM_APPENDED_BYTES)] __attribute__ ((aligned (4)));
#else
    #error This compiler is not supported.
#endif

static void RF_MapIO(void);
void clear_queue_buf(void);
void rec_forever_callback(RF_Handle h, RF_CmdHandle ch, RF_EventMask e);
static RF_CmdHandle Rf_rx_package(RF_Handle h,dataQueue_t *dataQueue, uint8_t* id, uint8_t pktLen,uint8_t enableTrigger,  uint32_t  timeout);

rfc_dataEntryGeneral_t* currentDataEntry;
RF_Object rfObject;
RF_Handle rfHandle;
dataQueue_t dataQueue;
RF_Status rf_status = RF_Status_idle;

static uint8_t _hb_rssi = 0;

List_List list;
MyStruct foo[2];
List_Elem *write2buf;
uint8_t data0[PAYLOAD_LENGTH] = {0};
uint8_t data1[PAYLOAD_LENGTH] = {0};
st_calib_value calib;

List_Elem* listInit(void)
{
    foo[0].tx =&RF_cmdPropTxAdv[0];
    foo[1].tx =&RF_cmdPropTxAdv[1];

    List_clearList(&list);
    List_put(&list, (List_Elem *)&foo[0]);
    List_put(&list, (List_Elem *)&foo[1]);
    list.tail->next = (List_Elem *)&foo[0];

    return List_head(&list);
}

void txcallback(RF_Handle h, RF_CmdHandle ch, RF_EventMask e)
{
    if (e & RF_EventCmdAborted)
    {

    }
    if (e & RF_EventCmdDone)
    {
        /* Successful TX */
        write2buf = List_next(write2buf);
        RF_SemSendPost();
    }else {

    }
}

void rxcallback(RF_Handle h, RF_CmdHandle ch, RF_EventMask e)
{
    if(e & RF_EventRxEntryDone)
    {
    	RF_SemRecvPost();
    }
    if(e & RF_EventLastCmdDone)
    {
          //指令已经执行完成
    }
}


void rf_init(void)
{
    RF_Params rfParams;
    RF_Params_init(&rfParams);

    if( RFQueue_defineQueue(&dataQueue, rxDataEntryBuffer,sizeof(rxDataEntryBuffer),NUM_DATA_ENTRIES, MAX_LENGTH_128 + NUM_APPENDED_BYTES))
    {
         /* Failed to allocate space for all data entries */
         while(1);
    }
    /* Request access to the radio */
    rfHandle = RF_open(&rfObject, &RF_prop, (RF_RadioSetup*)&RF_cmdPropRadioSetup, &rfParams);
    /* Set the frequency */
    RF_postCmd(rfHandle, (RF_Op*)&RF_cmdFs, RF_PriorityNormal, NULL, 0);

#ifdef  RF_TEST
    RF_MapIO();
#endif
    cc2592Init();
}
#define ESLWORKING_SET
#ifdef ESLWORKING_SET

//baseboard 13dbm, 10dbm, 6dbm, 0dbm
//const uint16_t rf_tx_power[POWER_LEVEL]={0x194e, 0x144b, 0x0cc9, 0x0cc5};
const uint16_t rf_all_tx_power[ALL_POWER_LEVEL]={0x0cc5,0x0cc6, 0x0cc7, 0x0cc9,0x0ccb,0x144b, 0x194e,0x1d52, 0x2558, 0x3161, 0x4214,0x4e18,0x5a1c, 0x9324, 0x9330};
//T3 board 13dbm, 10dbm, 6dbm, 0dbm
uint16_t rf_tx_power[POWER_LEVEL]={0x1d52, 0x194e, 0xCCB, 0x0cc7};
#define POWER_LEVEL2    2
#define POWER_LEVEL_MAX (sizeof(rf_tx_power)/sizeof(rf_tx_power[0])-1)
#else
#define POWER_LEVEL  15
#define MIN_POWER_LEVE -25
#define MAX_POWER_LEVE 5
#define POWER_ZERO_POSITION (POWER_LEVEL - MAX_POWER_LEVE - 1)
#define POWER_DECREASE_VALUE    3
//power greater than 0,  increase by 1. power less than 0, decrease by -3. 0x3161 is 0dbm.0x0cc5 is -25dbm
const uint16_t rf_tx_power[POWER_LEVEL]={0x0cc5,0x0cc6, 0x0cc7, 0x0cc9,0x0ccb,0x144b, 0x194e,0x1d52, 0x2558, 0x3161, 0x4214,0x4e18,0x5a1c, 0x9324, 0x9330};

#endif

const int8_t dbm_base[POWER_LEVEL] = {DBM13_BASE, DBM10_BASE, DBM6_BASE, DBM0_BASE};
void RF_configPower(void)
{
    int8_t n=0, i;
    for (i=0; i<POWER_LEVEL; i++){
        n = dbm_base[i]+calib.power_offset >= ALL_POWER_LEVEL ? ALL_POWER_LEVEL-1 : dbm_base[i]+calib.power_offset;
        n = dbm_base[i]+calib.power_offset < 0 ? DBM6_BASE : dbm_base[i]+calib.power_offset;
        rf_tx_power[i] = rf_all_tx_power[n];
    }
}

void set_frequence(uint8_t  Frequency)
{
    int8_t n = 0;
    RF_cmdFs.frequency = 2400+Frequency/2;
    RF_cmdFs.fractFreq = (Frequency%2 ? 32768 : 0);

    if (calib.frequency_offset == 0){
        goto setfreq;
    }else if (calib.frequency_offset > 0){
        n = (calib.frequency_offset>>16);
        calib.frequency_offset &= 0xffff;
    }else{
        calib.frequency_offset = ~calib.frequency_offset + 1;
        n = 0-(calib.frequency_offset>>16);
        calib.frequency_offset = 0-(calib.frequency_offset&0xffff);
    }

    if (calib.frequency_offset>=32768 && RF_cmdFs.fractFreq==32768){
        RF_cmdFs.fractFreq = calib.frequency_offset - 32768;
        RF_cmdFs.frequency++;
    }else if (calib.frequency_offset>=32768 && RF_cmdFs.fractFreq==0){
        RF_cmdFs.fractFreq = calib.frequency_offset;
    }else if (calib.frequency_offset>=0){
        RF_cmdFs.fractFreq += calib.frequency_offset;
    }else if (calib.frequency_offset<0 && 0==RF_cmdFs.fractFreq){
        RF_cmdFs.fractFreq += 65536+calib.frequency_offset;
        RF_cmdFs.frequency--;
    }else if ((calib.frequency_offset<0 && calib.frequency_offset>=-32768) && 32768==RF_cmdFs.fractFreq){
        RF_cmdFs.fractFreq = RF_cmdFs.fractFreq + calib.frequency_offset;
    }else {  //(calib.frequency_offset>-32768 && (32768==RF_cmdFs.fractFreq || 0==RF_cmdFs.fractFreq){
        RF_cmdFs.fractFreq += 65536+calib.frequency_offset;
        RF_cmdFs.frequency--;
    }
    RF_cmdFs.frequency += n;
setfreq:
    RF_runCmd(rfHandle, (RF_Op*)&RF_cmdFs, RF_PriorityNormal, NULL, 0);
}

void RF_calib_power(int8_t Tx_power)
{
    #ifdef ESLWORKING_SET
        RF_cmdPropRadioSetup.txPower = rf_all_tx_power[Tx_power];
    #else
        if (Tx_power<=MAX_POWER_LEVE && Tx_power>=0){
            RF_cmdPropRadioSetup.txPower = rf_tx_power[Tx_power+POWER_ZERO_POSITION];
        } else{
            if (Tx_power<0 && Tx_power>=MIN_POWER_LEVE){
                RF_cmdPropRadioSetup.txPower = rf_tx_power[POWER_ZERO_POSITION - ((~Tx_power+1)+POWER_DECREASE_VALUE-1)/POWER_DECREASE_VALUE];
            }
        }
    #endif
       RF_runCmd(rfHandle, (RF_Op*)&RF_cmdPropRadioSetup, RF_PriorityNormal, NULL, 0);
}

void set_power_rate(int8_t Tx_power, uint16_t Data_rate)
{
    switch(Data_rate)
    {
        case DATA_RATE_100K:
            RF_cmdPropRadioSetup.symbolRate.preScale = 15;
            RF_cmdPropRadioSetup.symbolRate.rateWord = 65536;
            RF_cmdPropRadioSetup.modulation.modType = 0x0;
            RF_cmdPropRadioSetup.modulation.deviation = 744;
            RF_cmdPropRadioSetup.rxBw = 9;
			RF_cmdPropRadioSetup.pRegOverride = (uint32_t*)pOverrides100;
        break;
        case  DATA_RATE_500K:
            RF_cmdPropRadioSetup.symbolRate.preScale = 15;
            RF_cmdPropRadioSetup.symbolRate.rateWord = 327680;
            RF_cmdPropRadioSetup.modulation.modType = 0x0;
            RF_cmdPropRadioSetup.modulation.deviation = 744;
            RF_cmdPropRadioSetup.rxBw = 10;
			RF_cmdPropRadioSetup.pRegOverride = (uint32_t*)pOverrides500;
        break;
        case  DATA_RATE_1M:
        break;
        case  DATA_RATE_2M:
        break;
        default:
            RF_cmdPropRadioSetup.symbolRate.preScale = 15;
            RF_cmdPropRadioSetup.symbolRate.rateWord = 327680;
            RF_cmdPropRadioSetup.modulation.modType = 0x0;
            RF_cmdPropRadioSetup.modulation.deviation = 744;
            RF_cmdPropRadioSetup.rxBw = 10;
			RF_cmdPropRadioSetup.pRegOverride = (uint32_t*)pOverrides500;
        break;
    }
#ifdef ESLWORKING_SET
    if (RF_DEFAULT_POWER != Tx_power){
        Tx_power = (Tx_power<0 || Tx_power>POWER_LEVEL_MAX) ? POWER_LEVEL2 : Tx_power;
        RF_cmdPropRadioSetup.txPower = rf_tx_power[Tx_power];
    }

#else
    if (Tx_power<=MAX_POWER_LEVE && Tx_power>=0){
        RF_cmdPropRadioSetup.txPower = rf_tx_power[Tx_power+POWER_ZERO_POSITION];
    } else{
        if (Tx_power<0 && Tx_power>=MIN_POWER_LEVE){
            RF_cmdPropRadioSetup.txPower = rf_tx_power[POWER_ZERO_POSITION - ((~Tx_power+1)+POWER_DECREASE_VALUE-1)/POWER_DECREASE_VALUE];
        }
    }
#endif
   RF_runCmd(rfHandle, (RF_Op*)&RF_cmdPropRadioSetup, RF_PriorityNormal, NULL, 0);
}

void send_data_init(uint8_t *id, uint8_t *data, uint8_t len, uint32_t timeout)
{
    RF_cmdPropTxAdv[0].startTrigger.triggerType = TRIG_NOW;
    RF_cmdPropTxAdv[0].startTrigger.pastTrig = 1;
    RF_cmdPropTxAdv[0].startTime = 0;
    RF_cmdPropTxAdv[0].pktLen = len;
    RF_cmdPropTxAdv[0].pPkt = data;
    RF_cmdPropTxAdv[0].syncWord = ((uint32_t)id[0]<<24) | ((uint32_t)id[1]<<16) | ((uint32_t)id[2]<<8) | id[3];
    RF_cmdPropTxAdv[0].pNextOp = NULL;
    /* Only run the RX command if TX is successful */
    RF_cmdPropTxAdv[0].condition.rule = COND_NEVER;
    cc2592Cfg(CC2592_TX);
}
#define MY_TEST_RF
#ifdef MY_TEST_RF
RF_EventMask send_async(uint32_t interal)
{
    RF_EventMask result;
   // RF_cmdPropTxAdv.startTime += interal + EasyLink_us_To_RadioTime(700);
    //result = RF_postCmd(rfHandle, (RF_Op*)&RF_cmdPropTxAdv, RF_PriorityNormal, NULL, 0);
    result = RF_runCmd(rfHandle, (RF_Op*)&RF_cmdPropTxAdv[0], RF_PriorityNormal, NULL, 0);
//    RF_yield(rfHandle);
    return result;
}



void RF_wait_cmd_finish(void)
{
    cc2592Cfg(CC2592_TX);
    RF_SemSendPend(RF_SEND_TIME/Clock_tickPeriod);
}
void send_chaningmode_init(void)
{
    RF_cmdPropTxAdv[0].pPkt = data0;
    RF_cmdPropTxAdv[1].pPkt = data1;
}

