jiushiggg/MR33/rf/cc2640r2_rf.c
uint16_t send_chaningmode(uint8_t *id, uint8_t *data, uint8_t len, uint32_t timeout)
{
    RF_EventMask result;
    cc2592Cfg(CC2592_TX);
    /* Modify CMD_PROP_TX and CMD_PROP_RX commands for application needs */
    RF_cmdPropTxAdv[0].startTrigger.triggerType = TRIG_NOW;
    RF_cmdPropTxAdv[0].startTrigger.pastTrig = 1;
    RF_cmdPropTxAdv[0].startTime = 0;
    RF_cmdPropTxAdv[0].pktLen = len;
    RF_cmdPropTxAdv[0].pPkt = data0;
    RF_cmdPropTxAdv[0].syncWord = ((uint32_t)id[0]<<24) | ((uint32_t)id[1]<<16) | ((uint32_t)id[2]<<8) | id[3];
    RF_cmdPropTxAdv[0].pNextOp = (rfc_radioOp_t *)&RF_cmdPropTxAdv[1];
    /* Only run the RX command if TX is successful */
    RF_cmdPropTxAdv[0].condition.rule = COND_STOP_ON_FALSE;

    /* Modify CMD_PROP_TX and CMD_PROP_RX commands for application needs */
    RF_cmdPropTxAdv[1].startTrigger.triggerType = TRIG_NOW;
    RF_cmdPropTxAdv[1].startTrigger.pastTrig = 1;
    RF_cmdPropTxAdv[1].startTime = 0;
    RF_cmdPropTxAdv[1].pktLen = len;
    RF_cmdPropTxAdv[1].pPkt = data1;
    RF_cmdPropTxAdv[1].syncWord = ((uint32_t)id[0]<<24) | ((uint32_t)id[1]<<16) | ((uint32_t)id[2]<<8) | id[3];
    RF_cmdPropTxAdv[1].pNextOp = (rfc_radioOp_t *)&RF_cmdPropTxAdv[0];
    /* Only run the RX command if TX is successful */
    RF_cmdPropTxAdv[1].condition.rule = COND_STOP_ON_FALSE;

    result = RF_postCmd(rfHandle, (RF_Op*)&RF_cmdPropTxAdv[0], RF_PriorityNormal, txcallback,
                        (RF_EventCmdDone | RF_EventLastCmdDone| RF_EventCmdAborted));
    return (uint16_t)result;
}
uint16_t send_flash_led_data(uint8_t *id0,uint8_t *data0, uint8_t *id1, uint8_t* data1)
{
    RF_EventMask result;
    cc2592Cfg(CC2592_TX);
    /* Modify CMD_PROP_TX and CMD_PROP_RX commands for application needs */
    RF_cmdPropTxAdv[0].startTrigger.triggerType = TRIG_NOW;
    RF_cmdPropTxAdv[0].startTrigger.pastTrig = 1;
    RF_cmdPropTxAdv[0].startTime = 0;
    RF_cmdPropTxAdv[0].pktLen = 6;
    RF_cmdPropTxAdv[0].pPkt = data0;
    RF_cmdPropTxAdv[0].syncWord = ((uint32_t)id0[0]<<24) | ((uint32_t)id0[1]<<16) | ((uint32_t)id0[2]<<8) | id0[3];
    RF_cmdPropTxAdv[0].pNextOp = (rfc_radioOp_t *)&RF_cmdPropTxAdv[1];
    /* Only run the RX command if TX is successful */
    RF_cmdPropTxAdv[0].condition.rule = COND_STOP_ON_FALSE;

    /* Modify CMD_PROP_TX and CMD_PROP_RX commands for application needs */
    RF_cmdPropTxAdv[1].startTrigger.triggerType = TRIG_NOW;
    RF_cmdPropTxAdv[1].startTrigger.pastTrig = 1;
    RF_cmdPropTxAdv[1].startTime = 0;
    RF_cmdPropTxAdv[1].pktLen = 26;
    RF_cmdPropTxAdv[1].pPkt = data1;
    RF_cmdPropTxAdv[1].syncWord = ((uint32_t)id1[0]<<24) | ((uint32_t)id1[1]<<16) | ((uint32_t)id1[2]<<8) | id1[3];
    RF_cmdPropTxAdv[1].pNextOp = NULL;
    /* Only run the RX command if TX is successful */
    RF_cmdPropTxAdv[1].condition.rule = COND_STOP_ON_FALSE;

    result = RF_runCmd(rfHandle, (RF_Op*)&RF_cmdPropTxAdv[0], RF_PriorityNormal, NULL, 0);
    return (uint16_t)result;
}

void send_pend(RF_EventMask result)
{
    //RF_pendCmd(rfHandle, result, RF_EventTxEntryDone|RF_EventLastCmdDone);
}
#else
RF_EventMask send_async(uint32_t interal)
{
    RF_EventMask result;
   // RF_cmdPropTxAdv.startTime += interal + EasyLink_us_To_RadioTime(700);
    result = RF_postCmd(rfHandle, (RF_Op*)&RF_cmdPropTxAdv, RF_PriorityNormal, NULL, 0);
    return result;
}

void send_pend(RF_EventMask result)
{
    RF_pendCmd(rfHandle, result, EASYLINK_RF_EVENT_MASK);
}
#endif
void RF_cancle(int16_t result)
{
    RF_cancelCmd(rfHandle, (RF_CmdHandle)result,0);
}
void RF_closeRF(void)
{
	RF_close(rfHandle);
	cc2592Close();
}
uint8_t send_data(uint8_t *id, uint8_t *data, uint8_t len, uint32_t timeout)
{
    send_data_init(id, data, len, timeout);
    RF_runCmd(rfHandle, (RF_Op*)&RF_cmdPropTxAdv[0], RF_PriorityNormal, NULL, 0);
    return len;
}
//timeout:us
uint8_t recv_data(uint8_t *id, uint8_t *data, uint8_t len, uint32_t timeout)
{
    RF_CmdHandle rx_event;

    cc2592Cfg(CC2592_RX_HG_MODE);
    rx_event = Rf_rx_package(rfHandle, &dataQueue, id, len, TRUE , timeout/Clock_tickPeriod);
    if (TRUE ==  RF_SemRecvPend ((timeout+100)/Clock_tickPeriod)){
        currentDataEntry = RFQueue_getDataEntry();
        memcpy(data, (uint8_t*)(&currentDataEntry->data), len+NUM_APPENDED_BYTES);
        _hb_rssi = data[len];
        RFQueue_nextEntry();
    }else{
        RF_cancelCmd(rfHandle, rx_event,0);
        currentDataEntry = RFQueue_getDataEntry();
//        memcpy(rf_test_buff, (uint8_t*)(&currentDataEntry->data), len);
        clear_queue_buf();
        len = 0;
    }
    return len;
}
void clear_queue_buf(void)
{
    currentDataEntry = RFQueue_getDataEntry();

    if(DATA_ENTRY_PENDING != currentDataEntry->status)
    {
        RFQueue_nextEntry();
    }
}

RF_EventMask send_without_wait(uint8_t *id, uint8_t *data, uint8_t len, uint8_t ch, uint32_t timeout)
{
    RF_EventMask result;
    set_frequence(ch);
    send_data_init(id, data, len, timeout);
    result = send_async(timeout);
    return result;
}

static RF_CmdHandle Rf_rx_package(RF_Handle h,dataQueue_t *dataQueue, uint8_t* id, uint8_t pktLen,uint8_t enableTrigger,  uint32_t  timeout)
{
    /* Modify CMD_PROP_RX command for application needs */
    RF_cmdPropRxAdv.syncWord0 = ((uint32_t)id[0]<<24) | ((uint32_t)id[1]<<16) | ((uint32_t)id[2]<<8) | id[3];
    RF_cmdPropRxAdv.pQueue = dataQueue;           /* Set the Data Entity queue for received data */
    RF_cmdPropRxAdv.maxPktLen = pktLen;        /* Implement packet length filtering to avoid PROP_ERROR_RXBUF */
    RF_cmdPropRxAdv.endTrigger.triggerType = (enableTrigger? TRIG_ABSTIME : TRIG_NEVER );
    RF_cmdPropRxAdv.endTrigger.bEnaCmd = (enableTrigger? 1 : 0 );
    RF_cmdPropRxAdv.endTime = RF_getCurrentTime();
    RF_cmdPropRxAdv.endTime += myRF_convertUsToRatTicks(timeout);
//    RF_cmdPropRxAdv.pktConf.bRepeatOk = 1;
//    RF_cmdPropRxAdv.pktConf.bUseCrc = 0x1;
//    RF_runCmd(rfHandle, (RF_Op*)&RF_cmdPropRx, RF_PriorityNormal, &callback, IRQ_RX_ENTRY_DONE);
    RF_CmdHandle result = RF_postCmd(rfHandle, (RF_Op*)&RF_cmdPropRxAdv, RF_PriorityNormal, &rxcallback, IRQ_RX_ENTRY_DONE);
    return result;
}

