jiushiggg/MR33/rf/cc2640r2_rf.c
void wait(uint32_t nus)
{

}


void enter_txrx(void)
{

}
void exit_txrx(void)
{
//    RF_yield(rfHandle);
    cc2592Cfg(CC2592_POWERDOWN);
}
void RF_idle(void)
{
    RF_yield(rfHandle);
}

void rf_preset_hb_recv(uint8_t b)
{
    if (b){
        RF_cmdPropRxAdv.rxConf.bAutoFlushCrcErr = 0;
        RF_cmdPropRxAdv.pktConf.bRepeatOk = 1;
        RF_cmdPropRxAdv.pktConf.bRepeatNok = 1;
        /* Discard ignored packets from Rx queue */
        RF_cmdPropRxAdv.rxConf.bAutoFlushIgnored = 1;
        /* Discard packets with CRC error from Rx queue */
        if( RFQueue_defineQueue(&dataQueue, rxHBDataEntryBuffer,sizeof(rxHBDataEntryBuffer),HB_NUM_DATA_ENTRIES, MAX_LENGTH + NUM_APPENDED_BYTES))
        {
             /* Failed to allocate space for all data entries */
             while(1);
        }
    }else {
        RF_cmdPropRxAdv.rxConf.bAutoFlushCrcErr = 1;
        RF_cmdPropRxAdv.pktConf.bRepeatOk = 0x0;
        RF_cmdPropRxAdv.pktConf.bRepeatNok = 1;
        /* Discard ignored packets from Rx queue */
        RF_cmdPropRxAdv.rxConf.bAutoFlushIgnored = 0;
        /* Discard packets with CRC error from Rx queue */
        if( RFQueue_defineQueue(&dataQueue, rxDataEntryBuffer,sizeof(rxDataEntryBuffer),NUM_DATA_ENTRIES, MAX_LENGTH_128 + NUM_APPENDED_BYTES))
        {
             /* Failed to allocate space for all data entries */
             while(1);
        }
    }
}

uint16_t RF_recvDataForever(uint8_t *id, uint8_t len)
{
    cc2592Cfg(CC2592_RX_HG_MODE);

    RF_cmdPropRxAdv.syncWord0 = ((uint32_t)id[0]<<24) | ((uint32_t)id[1]<<16) | ((uint32_t)id[2]<<8) | id[3];
    RF_cmdPropRxAdv.pQueue = &dataQueue;           /* Set the Data Entity queue for received data */
    RF_cmdPropRxAdv.maxPktLen = len;        /* Implement packet length filtering to avoid PROP_ERROR_RXBUF */
    RF_cmdPropRxAdv.endTrigger.triggerType = TRIG_NEVER;
    RF_cmdPropRxAdv.endTrigger.bEnaCmd = 0;
    RF_cmdPropRxAdv.endTime = 0;

    RF_CmdHandle cmdHandle = RF_postCmd(rfHandle, (RF_Op*)&RF_cmdPropRxAdv,
                                               RF_PriorityNormal, &rec_forever_callback,
                                               RF_EventRxEntryDone);
    return cmdHandle;
}

//convert CC2640's RSSI to A7106's RSSI. history question ,reference the page 76 of A7106 manual
#define RSSI_FACTOR     31    //(105, 170),(55, 15) => (rssi-15)/(dBm-55) = (170-15)/(105-55) =>rssi = 3.1*dBm-155.5
#define RSSI_CONSTANT   1555

uint8_t convertRSSI(int8_t n)
{
    uint16_t tmp_rssi = (~n + 1);
    if (tmp_rssi < 50) {
        return 10;
    } else if (tmp_rssi < 55){
        return 15;
    } else if (tmp_rssi <= 105){
        return (tmp_rssi*RSSI_FACTOR-RSSI_CONSTANT)/10;
    } else {
    	return	170;
    }
}

uint8_t get_recPkgRSSI(void)
{
    return convertRSSI(_hb_rssi);
}

uint8_t RF_readRegRSSI(void)
{
    int8_t n = RF_getRssi(rfHandle);
    //return ~n+1;
    return convertRSSI(n);
}

void RF_carrierWave(Bool flg)
{
    static RF_CmdHandle cw_ret = RF_Status_idle;
    if (true == flg){
        /* Send CMD_TX_TEST which sends forever */
        cc2592Cfg(CC2592_TX);
        cw_ret = RF_postCmd(rfHandle, (RF_Op*)&RF_cmdTxTest, RF_PriorityNormal, NULL, 0);
        rf_status = RF_Status_carrierWave;
    }else{
        RF_cancle(cw_ret);
        rf_status = RF_Status_idle;
    }


}
void RF_measureRSSI(Bool flg)
{
    static RF_CmdHandle rssi_ret = 0;
    if (true == flg){
        cc2592Cfg(CC2592_RX_HG_MODE);
        rssi_ret = RF_postCmd(rfHandle, (RF_Op*)&RF_cmdRxTest, RF_PriorityNormal, NULL, 0);
        rf_status = RF_Status_measureRSSI;
    }else {
        RF_cancle(rssi_ret);
        rf_status = RF_Status_idle;
    }
}

//untest
void RF_setMeasureRSSI(uint8_t b)
{
    if (b){
        //RF_cmdPropRxAdv.rxConf.bAutoFlushCrcErr = 0;
        RF_cmdPropRxAdv.pktConf.bRepeatOk = 1;
        RF_cmdPropRxAdv.pktConf.bUseCrc = 0;
    }else {
        //RF_cmdPropRxAdv.rxConf.bAutoFlushCrcErr = 1;
        RF_cmdPropRxAdv.pktConf.bRepeatOk = 0;
        RF_cmdPropRxAdv.pktConf.bUseCrc = 1;
    }
}


int16_t set_rx_para(uint8_t *id, uint16_t datarate, uint8_t ch, uint8_t fifosize, uint32_t timeout)
{
    timeout *= 1000000;
    cc2592Cfg(CC2592_RX_HG_MODE);
    set_power_rate(RF_DEFAULT_POWER, datarate);
    set_frequence(ch);
    return Rf_rx_package(rfHandle, &dataQueue, id, fifosize, TRUE , timeout/Clock_tickPeriod);
}

int8_t check_rx_status(uint16_t timeout) //unit ms
{
    timeout = timeout * 1000;

    if (TRUE == RF_SemRecvPend(timeout/Clock_tickPeriod)){
        return 0;
    }else{
        return 1;
    }
}
int32_t get_rx_data(uint8_t *dst, uint8_t dstsize)
{
    currentDataEntry = RFQueue_getDataEntry();
    memcpy(dst, (uint8_t*)(&currentDataEntry->data), dstsize+2);
    RFQueue_nextEntry();
    _hb_rssi = dst[dstsize];
    return 1;
}

void sense_test_callback(RF_Handle h, RF_CmdHandle ch, RF_EventMask e)
{
    if (e & RF_EventRxEntryDone)
    {

        /* Get current unhandled data entry */
        currentDataEntry = RFQueue_getDataEntry();

        /* Handle the packet data, located at &currentDataEntry->data: */
//        packetLength      = MAX_LENGTH;
//        packetDataPointer = (uint8_t*)(&currentDataEntry->data);

        /* Copy the payload + the status byte to the packet variable */
//        memcpy(packet, packetDataPointer, (packetLength + NUM_APPENDED_BYTES));

        RFQueue_nextEntry();
    }
}
#if 0
void RF_senseTestFunction(void)
{
	uint8_t buff1[1]={0};

	IOCPinTypeGpioOutput(RF_TX_TEST_IO);	//set out put
	IOCPortConfigureSet(RF_TX_TEST_IO, IOC_PORT_RFC_GPO2, IOC_IOMODE_INV);		//map IO and Inverted


    /* Modify CMD_PROP_RX command for application needs */
	RF_cmdPropRxAdv.pQueue = &dataQueue;           /* Set the Data Entity queue for received data */
    RF_cmdPropRxAdv.rxConf.bAutoFlushIgnored = 1;  /* Discard ignored packets from Rx queue */
    RF_cmdPropRxAdv.rxConf.bAutoFlushCrcErr = 1;   /* Discard packets with CRC error from Rx queue */
    RF_cmdPropRxAdv.rxConf.bIncludeCrc = 0;		// jeffrey
    RF_cmdPropRxAdv.rxConf.bAppendRssi = 0;	// jeffrey
    RF_cmdPropRxAdv.rxConf.bAppendStatus = 0;
    RF_cmdPropRxAdv.maxPktLen = MAX_LENGTH;        /* Implement packet length filtering to avoid PROP_ERROR_RXBUF */
    RF_cmdPropRxAdv.pktConf.bRepeatOk = 1;
    RF_cmdPropRxAdv.pktConf.bRepeatNok = 1;

#define SENCE_TEST
#define TEST_DATA_ADDR	(2*4096)
#if defined(SENCE_TEST)
#define SENCE_TEST1		2401
#define SENCE_TEST2		2455
#define SENCE_TEST3		2485
#else
#define SENCE_TEST1		2401
#define SENCE_TEST2		2445
#define SENCE_TEST3		2480
#endif
#include "extern_flash.h"
#include "flash.h"
    Flash_Read(TEST_DATA_ADDR, buff1, sizeof(buff1));
    switch(buff1[0])
    {
    case 0xaa:
        buff1[0] = 0xbb;
        RF_cmdFs.frequency = SENCE_TEST2;
        break;
    case 0xbb:
        buff1[0] = 0xcc;
        RF_cmdFs.frequency = SENCE_TEST3;
        break;
    case 0xcc:
    default:
        buff1[0] = 0xaa;
        RF_cmdFs.frequency = SENCE_TEST1;
        break;
    }
    CMD_SE(TEST_DATA_ADDR);
    Flash_Write(TEST_DATA_ADDR, buff1, sizeof(buff1));

    set_power_rate(RF_DEFAULT_POWER, DATA_RATE_500K);
#if defined(SENCE_TEST)
    cc2592Cfg(CC2592_RX_HG_MODE);
    RF_postCmd(rfHandle, (RF_Op*)&RF_cmdFs, RF_PriorityNormal, NULL, 0);

    /* Enter RX mode and stay forever in RX */
    RF_runCmd(rfHandle, (RF_Op*)&RF_cmdPropRxAdv, RF_PriorityNormal, &sense_test_callback, IRQ_RX_ENTRY_DONE);
#else
    cc2592Cfg(CC2592_TX);
    RF_postCmd(rfHandle, (RF_Op*)&RF_cmdFs, RF_PriorityNormal, NULL, 0);
    RF_postCmd(rfHandle, (RF_Op*)&RF_cmdTxTest, RF_PriorityNormal, NULL, 0);
#endif
    while(1);
}
#endif
static void RF_MapIO(void)
{
    HWREG(RFC_DBELL_BASE + RFC_DBELL_O_SYSGPOCTL) = RFC_DBELL_SYSGPOCTL_GPOCTL0_CPEGPO0 |RFC_DBELL_SYSGPOCTL_GPOCTL1_RATGPO0 | RFC_DBELL_SYSGPOCTL_GPOCTL2_MCEGPO1 | RFC_DBELL_SYSGPOCTL_GPOCTL3_RATGPO1;
//    IOCIOPortIdSet(RF_RX_SYNC_TEST_IO, IOC_PORT_RFC_GPO3);
//    IOCIOPortIdSet(RF_RX_DATA_TEST_IO, IOC_PORT_RFC_GPO2);
    IOCIOPortIdSet(RF_TX_TEST_IO,      IOC_PORT_RFC_GPO1);
    IOCIOPortIdSet(RF_RX_TEST_IO,      IOC_PORT_RFC_GPO0);
}

